In [105]:
"""
    CASO O PANDAS OU OUTRA BIBLIOTECA UTILIZADA NÂO ESTEJAM INSTALADOS EXECUTE:
      #instalar Pandas 
        !pip install pandas
"""
#Importando o pandas para a aplicação:
import pandas as pd

#### Data Series X Data Frame

In [106]:
#Criando series
nomes = [
    'Thiago Gambati',
    'Manoel Neto',
    'Joesley Ferreira',
    'Ingrid Dandara'
]
indice = [0,1,2,3]
ex_series = pd.Series(nomes, indice, name = 'Nomes')
ex_series

0      Thiago Gambati
1         Manoel Neto
2    Joesley Ferreira
3      Ingrid Dandara
Name: Nomes, dtype: object

In [107]:
#Criando DataFrame
df = pd.DataFrame({
    "nome" : ['Thiago Gambati', 'Manoel Neto', 'Joesley Ferreira', 'Ingrid Dandara'], 
    "idade" : [22, 21, 23, 21],
    "faculdade" : ['Ciência da Computação', 'Educação Física', 'Arquitetura', 'Medicina Veterinária']
})
df

               nome  idade              faculdade
0    Thiago Gambati     22  Ciência da Computação
1       Manoel Neto     21        Educação Física
2  Joesley Ferreira     23            Arquitetura
3    Ingrid Dandara     21   Medicina Veterinária

In [108]:
#Obtendo coluna específica
df["faculdade"] #Toda coluna de um Data Frame é uma Data Series

0    Ciência da Computação
1          Educação Física
2              Arquitetura
3     Medicina Veterinária
Name: faculdade, dtype: object

#### Importando dados

In [109]:
#Salvando o arquivo em uma variável a ser trabalhada
dados = pd.read_csv(
    r"C:\Users\thiag\OneDrive\Documentos\Python Scripts\Formação DEX\Pandas\Arquivos da Aplicação\credit_card_clients.csv")
dados

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
0,1,20000,2,2,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,1
1,2,120000,2,2,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,1
2,3,90000,2,2,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,0
3,4,50000,2,2,1,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,0
4,5,50000,1,2,1,57,-1,0,-1,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
29995,29996,220000,1,3,1,39,0,0,0,0,...,88004,31237,15980,8500,20000,5003,3047,5000,1000,0
29996,29997,150000,1,3,2,43,-1,-1,-1,-1,...,8979,5190,0,1837,3526,8998,129,0,0,0
29997,29998,30000,1,2,2,37,4,3,2,-1,...,20878,20582,19357,0,0,22000,4200,2000,3100,1
29998,29999,80000,1,3,1,41,1,-1,0,0,...,52774,11855,48944,85900,3409,1178,1926,52964,1804,1
29999,30000,50000,1,2,1,46,0,0,0,0,...,36535,32428,15313,2078,1800,1430,1000,1000,1000,1

Metadados do DataFrame:

O conjunto de dados credit contém informações sobre pagamentos, fatores demográficos, dados de crédito, histórico de pagamentos e extratos de contas de clientes de cartão de crédito em Taiwan de abril de 2005 a setembro de 2005.

O DataFrame contém 25 variáveis:

ID: ID de cada cliente.

LIMIT_BAL: Valor do crédito concedido em NT (New Taiwan) dólar (inclui crédito individual e familiar/complementar).

SEXO: Gênero (1=masculino, 2=feminino).

EDUCAÇÃO: (1 = pós-graduação, 2 = universidade, 3 = ensino médio, 4 = outros, 5 = desconhecido, 6 = desconhecido).

CASAMENTO: Estado civil (1=casado, 2=solteiro, 3=outros).

IDADE: Idade em anos.

PAY_0: Status de pagamento em setembro de 2005 .(-1=pagamento devido, 1=atraso de pagamento por um mês, 2=atraso de pagamento por dois meses, … 8=atraso de pagamento por oito meses, 9=atraso de pagamento por nove meses e acima).

PAY_2: Status de reembolso em agosto de 2005 (escala igual à acima).

PAY_3: Status de reembolso em julho de 2005 (escala igual à acima).

PAY_4: Status de reembolso em junho de 2005 (escala igual à acima).

PAY_5: Status de reembolso em maio de 2005 (escala igual à acima).

PAY_6: Status de reembolso em abril de 2005 (escala igual à acima).

BILL_AMT1: Valor do extrato da conta em setembro de 2005 (dólar NT).

BILL_AMT2: Valor do extrato da conta em agosto de 2005 (dólar NT).

BILL_AMT3: Valor do extrato da conta em julho de 2005 (dólar NT).

BILL_AMT4: Valor do extrato da conta em junho de 2005 (dólar NT).

BILL_AMT5: Valor do extrato da conta em maio de 2005 (dólar NT).

BILL_AMT6: Valor do extrato da conta em abril de 2005 (dólar NT).

PAY_AMT1: Valor do pagamento anterior em setembro de 2005 (dólar NT).

PAY_AMT2: Valor do pagamento anterior em agosto de 2005 (dólar NT).

PAY_AMT3: Valor do pagamento anterior em julho de 2005 (dólar NT).

PAY_AMT4: Valor do pagamento anterior em junho de 2005 (dólar NT).

PAY_AMT5: Valor do pagamento anterior em maio de 2005 (dólar NT).

PAY_AMT6: Valor do pagamento anterior em abril de 2005 (dólar NT).

default.payment.next.month: Pagamento padrão (1=sim, 0=não).

#### Extraindo informações do DataFrame

In [110]:
#Mostrando informações das colunas
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30000 entries, 0 to 29999
Data columns (total 25 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   ID                          30000 non-null  int64
 1   LIMIT_BAL                   30000 non-null  int64
 2   SEX                         30000 non-null  int64
 3   EDUCATION                   30000 non-null  int64
 4   MARRIAGE                    30000 non-null  int64
 5   AGE                         30000 non-null  int64
 6   PAY_0                       30000 non-null  int64
 7   PAY_2                       30000 non-null  int64
 8   PAY_3                       30000 non-null  int64
 9   PAY_4                       30000 non-null  int64
 10  PAY_5                       30000 non-null  int64
 11  PAY_6                       30000 non-null  int64
 12  BILL_AMT1                   30000 non-null  int64
 13  BILL_AMT2                   30000 non-null  int64
 14  BILL_AMT3                   30000 non-null  int64
 15  BILL_AMT4                   30000 non-null  int64
 16  BILL_AMT5                   30000 non-null  int64
 17  BILL_AMT6                   30000 non-null  int64
 18  PAY_AMT1                    30000 non-null  int64
 19  PAY_AMT2                    30000 non-null  int64
 20  PAY_AMT3                    30000 non-null  int64
 21  PAY_AMT4                    30000 non-null  int64
 22  PAY_AMT5                    30000 non-null  int64
 23  PAY_AMT6                    30000 non-null  int64
 24  default payment next month  30000 non-null  int64
dtypes: int64(25)
memory usage: 5.7 MB

In [111]:
#Mostrando 7 primeiros registros do DataFrame
dados.head(7)

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
0,1,20000,2,2,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,1
1,2,120000,2,2,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,1
2,3,90000,2,2,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,0
3,4,50000,2,2,1,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,0
4,5,50000,1,2,1,57,-1,0,-1,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,0
5,6,50000,1,1,2,37,0,0,0,0,...,19394,19619,20024,2500,1815,657,1000,1000,800,0
6,7,500000,1,1,2,29,0,0,0,0,...,542653,483003,473944,55000,40000,38000,20239,13750,13770,0

In [112]:
#Mostrando 7 últimos registros do DataFrame
dados.tail(7)

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
29993,29994,100000,1,1,2,38,0,-1,-1,0,...,70626,69473,55004,2000,111784,4000,3000,2000,2000,0
29994,29995,80000,1,2,2,34,2,2,2,2,...,77519,82607,81158,7000,3500,0,7000,0,4000,1
29995,29996,220000,1,3,1,39,0,0,0,0,...,88004,31237,15980,8500,20000,5003,3047,5000,1000,0
29996,29997,150000,1,3,2,43,-1,-1,-1,-1,...,8979,5190,0,1837,3526,8998,129,0,0,0
29997,29998,30000,1,2,2,37,4,3,2,-1,...,20878,20582,19357,0,0,22000,4200,2000,3100,1
29998,29999,80000,1,3,1,41,1,-1,0,0,...,52774,11855,48944,85900,3409,1178,1926,52964,1804,1
29999,30000,50000,1,2,1,46,0,0,0,0,...,36535,32428,15313,2078,1800,1430,1000,1000,1000,1

In [113]:
#Consultando dimensões
dados.shape

(30000, 25)

In [114]:
#Renomeando colunas
dados_renamed = dados.rename(columns = {'LIMIT_BAL' : 'valor_credito',
                                        'SEX' : 'sexo',
                                        'EDUCATION' : 'escolaridade',
                                        'MARRIAGE':'estado_civil',
                                        'AGE':'idade',
                                        'PAY_0':'status_pag_set_2005',
                                        'PAY_2':'status_pag_ago_2005',
                                        'PAY_3':'status_pag_jul_2005',
                                        'PAY_4':'status_pag_jun_2005',
                                        'PAY_5':'status_pag_mai_2005',
                                        'PAY_6':'status_pag_abr_2005',
                                        'BILL_AMT1':'extrato_set_2005',
                                        'BILL_AMT2':'extrato_ago_2005',
                                        'BILL_AMT3':'extrato_jul_2005',
                                        'BILL_AMT4':'extrato_jun_2005',
                                        'BILL_AMT5':'extrato_mai_2005',
                                        'BILL_AMT6':'extrato_abr_2005',
                                        'PAY_AMT1':'valor_pag_set_2005',
                                        'PAY_AMT2':'valor_pag_ago_2005',
                                        'PAY_AMT3':'valor_pag_jul_2005',
                                        'PAY_AMT4':'valor_pag_jun_2005',
                                        'PAY_AMT5':'valor_pag_mai_2005',
                                        'PAY_AMT6':'valor_pag_abr_2005'})
dados_renamed

,ID,valor_credito,sexo,escolaridade,estado_civil,idade,status_pag_set_2005,status_pag_ago_2005,status_pag_jul_2005,status_pag_jun_2005,...,extrato_jun_2005,extrato_mai_2005,extrato_abr_2005,valor_pag_set_2005,valor_pag_ago_2005,valor_pag_jul_2005,valor_pag_jun_2005,valor_pag_mai_2005,valor_pag_abr_2005,default payment next month
0,1,20000,2,2,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,1
1,2,120000,2,2,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,1
2,3,90000,2,2,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,0
3,4,50000,2,2,1,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,0
4,5,50000,1,2,1,57,-1,0,-1,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
29995,29996,220000,1,3,1,39,0,0,0,0,...,88004,31237,15980,8500,20000,5003,3047,5000,1000,0
29996,29997,150000,1,3,2,43,-1,-1,-1,-1,...,8979,5190,0,1837,3526,8998,129,0,0,0
29997,29998,30000,1,2,2,37,4,3,2,-1,...,20878,20582,19357,0,0,22000,4200,2000,3100,1
29998,29999,80000,1,3,1,41,1,-1,0,0,...,52774,11855,48944,85900,3409,1178,1926,52964,1804,1
29999,30000,50000,1,2,1,46,0,0,0,0,...,36535,32428,15313,2078,1800,1430,1000,1000,1000,1

In [115]:
'''
Caso essa linha seja executada mais de uma vez, resultará em erro, pois a coluna
"default payment next month" já foi apagada
'''
#Excluindo uma coluna
                                    #inplace aplica as ações no DataFrame caso (True)
dados_renamed.drop("default payment next month", axis = 1, inplace = True) 
dados_renamed

,ID,valor_credito,sexo,escolaridade,estado_civil,idade,status_pag_set_2005,status_pag_ago_2005,status_pag_jul_2005,status_pag_jun_2005,...,extrato_jul_2005,extrato_jun_2005,extrato_mai_2005,extrato_abr_2005,valor_pag_set_2005,valor_pag_ago_2005,valor_pag_jul_2005,valor_pag_jun_2005,valor_pag_mai_2005,valor_pag_abr_2005
0,1,20000,2,2,1,24,2,2,-1,-1,...,689,0,0,0,0,689,0,0,0,0
1,2,120000,2,2,2,26,-1,2,0,0,...,2682,3272,3455,3261,0,1000,1000,1000,0,2000
2,3,90000,2,2,2,34,0,0,0,0,...,13559,14331,14948,15549,1518,1500,1000,1000,1000,5000
3,4,50000,2,2,1,37,0,0,0,0,...,49291,28314,28959,29547,2000,2019,1200,1100,1069,1000
4,5,50000,1,2,1,57,-1,0,-1,0,...,35835,20940,19146,19131,2000,36681,10000,9000,689,679
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
29995,29996,220000,1,3,1,39,0,0,0,0,...,208365,88004,31237,15980,8500,20000,5003,3047,5000,1000
29996,29997,150000,1,3,2,43,-1,-1,-1,-1,...,3502,8979,5190,0,1837,3526,8998,129,0,0
29997,29998,30000,1,2,2,37,4,3,2,-1,...,2758,20878,20582,19357,0,0,22000,4200,2000,3100
29998,29999,80000,1,3,1,41,1,-1,0,0,...,76304,52774,11855,48944,85900,3409,1178,1926,52964,1804
29999,30000,50000,1,2,1,46,0,0,0,0,...,49764,36535,32428,15313,2078,1800,1430,1000,1000,1000

In [116]:
#Salvando dados do DataFrame em arquivo
dados_renamed.to_excel("Arquivos da Aplicação/Resultado.xlsx")859 439

In [119]:
#Acessando rotulo das linhas
dados_renamed.index

RangeIndex(start=0, stop=30000, step=1)

In [121]:
#Acessando rotulo das colunas
dados_renamed.columns

Index(['ID', 'valor_credito', 'sexo', 'escolaridade', 'estado_civil', 'idade',
       'status_pag_set_2005', 'status_pag_ago_2005', 'status_pag_jul_2005',
       'status_pag_jun_2005', 'status_pag_mai_2005', 'status_pag_abr_2005',
       'extrato_set_2005', 'extrato_ago_2005', 'extrato_jul_2005',
       'extrato_jun_2005', 'extrato_mai_2005', 'extrato_abr_2005',
       'valor_pag_set_2005', 'valor_pag_ago_2005', 'valor_pag_jul_2005',
       'valor_pag_jun_2005', 'valor_pag_mai_2005', 'valor_pag_abr_2005'],
      dtype='object')

In [123]:
#Acessando rotulo das colunas de outra forma
dados_renamed.keys()

Index(['ID', 'valor_credito', 'sexo', 'escolaridade', 'estado_civil', 'idade',
       'status_pag_set_2005', 'status_pag_ago_2005', 'status_pag_jul_2005',
       'status_pag_jun_2005', 'status_pag_mai_2005', 'status_pag_abr_2005',
       'extrato_set_2005', 'extrato_ago_2005', 'extrato_jul_2005',
       'extrato_jun_2005', 'extrato_mai_2005', 'extrato_abr_2005',
       'valor_pag_set_2005', 'valor_pag_ago_2005', 'valor_pag_jul_2005',
       'valor_pag_jun_2005', 'valor_pag_mai_2005', 'valor_pag_abr_2005'],
      dtype='object')

In [126]:
#Identificando os valores do DataSet a partir de um objeto ndarray
dados_renamed.values

array([[     1,  20000,      2, ...,      0,      0,      0],
       [     2, 120000,      2, ...,   1000,      0,   2000],
       [     3,  90000,      2, ...,   1000,   1000,   5000],
       ...,
       [ 29998,  30000,      1, ...,   4200,   2000,   3100],
       [ 29999,  80000,      1, ...,   1926,  52964,   1804],
       [ 30000,  50000,      1, ...,   1000,   1000,   1000]], dtype=int64)

In [128]:
#Identificando os valores do DataSet a partir de um objeto ndarray de outra forma
dados_renamed.to_numpy()

array([[     1,  20000,      2, ...,      0,      0,      0],
       [     2, 120000,      2, ...,   1000,      0,   2000],
       [     3,  90000,      2, ...,   1000,   1000,   5000],
       ...,
       [ 29998,  30000,      1, ...,   4200,   2000,   3100],
       [ 29999,  80000,      1, ...,   1926,  52964,   1804],
       [ 30000,  50000,      1, ...,   1000,   1000,   1000]], dtype=int64)

In [131]:
#Identificando os tipos de dados contidos em cada coluna
dados_renamed.dtypes

ID                     int64
valor_credito          int64
sexo                   int64
escolaridade           int64
estado_civil           int64
idade                  int64
status_pag_set_2005    int64
status_pag_ago_2005    int64
status_pag_jul_2005    int64
status_pag_jun_2005    int64
status_pag_mai_2005    int64
status_pag_abr_2005    int64
extrato_set_2005       int64
extrato_ago_2005       int64
extrato_jul_2005       int64
extrato_jun_2005       int64
extrato_mai_2005       int64
extrato_abr_2005       int64
valor_pag_set_2005     int64
valor_pag_ago_2005     int64
valor_pag_jul_2005     int64
valor_pag_jun_2005     int64
valor_pag_mai_2005     int64
valor_pag_abr_2005     int64
dtype: object